# NeutralRequired Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..NeutralRequired Property
WireType Class See Also
---
Whether or not the neutral point is required.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool NeutralRequired { get; set; }
```

Visual Basic
---
```text
Public Property NeutralRequired As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool NeutralRequired {
	bool get ();
	void set (bool value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace